
&НаСервере
Процедура БилетыБилетПриИзмененииНаСервере(Билет, ТипБилета, ИндексСтроки)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	  	"ВЫБРАТЬ
		|	Цены.Цена
		|ИЗ
		|   РегистрСведений.Цены КАК Цены
		|ГДЕ
		|	Цены.Билет = &Значение";
	Запрос.УстановитьПараметр("Значение", Билет);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	ЦенаПолногоБилета = 0;
	Пока РезультатЗапроса.Следующий()Цикл
		Цена = РезультатЗапроса.Цена;
	КонецЦикла;
	Если (ТипБилета = Перечисления.ТипБилета.Полный) Тогда 
		Объект.Билеты[ИндексСтроки].Цена = Цена;
	Иначе; 
		Если (ТипБилета = Перечисления.ТипБилета.Детский) Тогда
			Объект.Билеты[ИндексСтроки].Цена = Цена*0.7;
		Иначе
			Объект.Билеты[ИндексСтроки].Цена = Цена*0.6;
	   	КонецЕсли;
	КонецЕсли;
	
	ИтоговаяЦена = 0;
	Для Каждого СтрокаТаблицы из Объект.Билеты Цикл
		Если ЗначениеЗаполнено(Цена) Тогда
			ИтоговаяЦена = ИтоговаяЦена + СтрокаТаблицы.Цена;	
		КонецЕсли;	
	КонецЦикла;	
	Объект.ИтоговаяЦена = ИтоговаяЦена;
	
КонецПроцедуры

&НаКлиенте
Процедура БилетыБилетПриИзменении(Элемент)
	Таблица = Объект.Билеты;
	Для Каждого СтрокаТаблицы из Таблица Цикл
		Билет = СтрокаТаблицы.Билет;
		ТипБилета = СтрокаТаблицы.ТипБилета;
		Если (ЗначениеЗаполнено(Билет) И ЗначениеЗаполнено(ТипБилета)) Тогда			 
			 ИндексСтроки = СтрокаТаблицы.ПолучитьИдентификатор();
			 БилетыБилетПриИзмененииНаСервере(Билет,ТипБилета, ИндексСтроки);			 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура БилетыТипБилетаПриИзменении(Элемент)
	Таблица = Объект.Билеты;
	Для Каждого СтрокаТаблицы из Таблица Цикл
		Билет = СтрокаТаблицы.Билет;
		ТипБилета = СтрокаТаблицы.ТипБилета;
		Если (ЗначениеЗаполнено(Билет) И ЗначениеЗаполнено(ТипБилета)) Тогда			 
			 ИндексСтроки = СтрокаТаблицы.ПолучитьИдентификатор();
			 БилетыБилетПриИзмененииНаСервере(Билет,ТипБилета, ИндексСтроки);			 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
